# Example 1

INNER JOIN

## Import libraries

In [1]:
import sqlite3
import pandas as pd

## Create a connection object

In [2]:
con = sqlite3.connect('../Database.db')
cur = con.cursor()

## SQL statement

In [3]:
# A JOIN clause is used to combine rows from two or more tables, based on a related column between them.
# The INNER JOIN keyword selects records that have matching values in both tables.
# SELECT column_name(s)
# FROM table1
# INNER JOIN table2 ON table1.column_name = table2.column_name
query = '''
            SELECT Orders.OrderID, Customers.CustomerName
            FROM Orders
            INNER JOIN Customers ON Orders.CustomerID = Customers.CustomerID
        '''

## Show table

In [4]:
df = pd.read_sql_query(query, con)
df.head()

   OrderID            CustomerName
0    10248             Wilman Kala
1    10249  Tradição Hipermercados
2    10250           Hanari Carnes
3    10251    Victuailles en stock
4    10252        Suprêmes délices

In [5]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 196 entries, 0 to 195
Data columns (total 2 columns):
 #   Column        Non-Null Count  Dtype
---  ------        --------------  -----
 0   OrderID       196 non-null    int64
 1   CustomerName  196 non-null    object
dtypes: int64(1), object(1)
memory usage: 3.2+ KB

## Close the connection

In [6]:
con.close()